* DONE 线性代数是研究什么的? 
CLOSED: [2023-02-09 Thu 13:18]
- State "DONE"       from "STARTED"    [2023-02-09 Thu 13:18]
:LOGBOOK:
CLOCK: [2023-02-09 Thu 13:06]--[2023-02-09 Thu 13:18] =>  0:12
CLOCK: [2023-02-09 Thu 11:18]--[2023-02-09 Thu 11:24] =>  0:06
:END:
预计一个小时
出乎意料的快

要更快学会线性, 必须从实用的角度快速思考线性解决了什么问题

速度, 线性代数, 数学的世界是抽象的世界, 数学就是自然界/世界的规律提炼, 以及逻辑推算

- [X] 线性代数就是线性空间的抽象, 3d 空间可以折叠, 叠加, 分解, 例如使用矩阵来表示 3d 的思想, 源自线性代数
- [X] 术语
  - [X] 向量的加减乘除
  - [X] 两个向量的角度: 外积和内积
  - [X] 矩阵
  - [X] 初等变换
  - [X] 向量的行列式

* STARTED [#A] 向量大纲
DEADLINE: <2023-02-15 Wed 12:00>
:LOGBOOK:
CLOCK: [2023-02-16 Thu 19:41]--[2023-02-16 Thu 19:52] =>  0:11
CLOCK: [2023-02-16 Thu 16:32]--[2023-02-16 Thu 16:55] =>  0:23
CLOCK: [2023-02-15 Wed 16:03]--[2023-02-15 Wed 16:06] =>  0:03
CLOCK: [2023-02-15 Wed 15:40]--[2023-02-15 Wed 15:58] =>  0:18
CLOCK: [2023-02-15 Wed 02:00]--[2023-02-15 Wed 03:22] =>  1:22
CLOCK: [2023-02-13 Mon 09:04]--[2023-02-13 Mon 09:35] =>  0:31
CLOCK: [2023-02-09 Thu 14:02]--[2023-02-09 Thu 14:45] =>  0:43
CLOCK: [2023-02-09 Thu 13:37]--[2023-02-09 Thu 13:54] =>  0:17
:END:
- [-] 向量
  - [-] 向量定义
    - [-] 组成元素: 方向, 长度(模), 起点
    - [X] 向量模: 长度
    - [X] == : 只要求模和方向, 不要求起点
    - [X] 向量种类
    - [X] 相等, 相反向量
    - [X] 零向量: 模为0, 方向任意
    - [X] 单位向量: 某个方向上模为 1, 则该向量是该方向的单位向量.
  - [-] 线性运算
    - [-] 加减:
      - [X] 运算意义: 满足交换率和结合率
        - [X] 推导证明
          - [X] 三角型 : 证明向量并非普通的距离抽象符号
          - [X] 平行四边型 : 两条非共线向量的虚拟一个平行四边型, 对角线为向量和.
      - [ ] 用途: 
    - [ ] 数乘: 实数和向量的积为一个向量
      - [ ] 运算意义: 满足结合率
        - [ ] 推导证明
      - [ ] 用途: 判定向量共线
  - [ ] 平面坐标: 
    什么是平面坐标: 向量可以映射到坐标上, 根据向量的运算, 两条和横纵线同向的向量做基座, 可以把任意的向量映射到其上, 也就是每个向量可以给他一个点, 这个点对应二维坐标 
    - [ ] Mod: 三点共线
      - [ ] 
- [ ] 外积和内积: 更加抽象的概念, 设计到向量的角度计算, 行列式计算的底层支柱
  - [ ] 内积: a*b = |a||b|cos&
    - [ ] 用途: 判定是否 
  - [ ] 外积
- [ ] 向量的空间运算   : 有说线性代数有对 3d 空间的折叠研究
  - [ ] 行列式: 用来表示外积
  - [ ] 矩阵: 将方程组的常量剥离出来
- [ ] 初等变换 : 将行列式和矩阵转换
    
* STARTED 基本概念懂后, 从去年那份试卷找解题模板 !!!
DEADLINE: <2023-02-15 Wed 23:00>

* STARTED 教材复习 
DEADLINE: <2023-02-16 Thu>

* STARTED 重做试卷
DEADLINE: <2023-02-20 Sat>